---
kind: property
id: P:Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryDepth
source: html/47254f2e-5b1e-6e6f-8b5c-cdd79483c807.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryDepth Property

Depth of required ancillary if it isn't round.

## Syntax (C#)
```csharp
public double AncillaryDepth { get; }
```